In [1]:
import pandas as pd
import numpy as np
import string

t = pd.DataFrame(np.arange(12).reshape(3,4),index=list(string.ascii_uppercase[:3]),columns=list(string.ascii_uppercase[-4:]))

In [2]:
t.loc["A","W"]

0

In [3]:
t.loc["A",["W","Z"]]

W    0
Z    3
Name: A, dtype: int32

In [4]:
type(t.loc["A",["W","Z"]])

pandas.core.series.Series

In [5]:
t.loc[["A","C"],["W","Z"]]

   W   Z
A  0   3
C  8  11

In [6]:
t.loc["A":,["W","Z"]]

   W   Z
A  0   3
B  4   7
C  8  11

In [7]:
t.loc["A":"C",["W","Z"]]

   W   Z
A  0   3
B  4   7
C  8  11

In [8]:
t.iloc[1:3,[2,3]]

    Y   Z
B   6   7
C  10  11

In [9]:
t.loc["A","Y"]=100

In [10]:
t

   W  X    Y   Z
A  0  1  100   3
B  4  5    6   7
C  8  9   10  11

In [12]:
t.iloc[1:3,1:3]

   X   Y
B  5   6
C  9  10

In [13]:
t.iloc[1:2,0:2]=200
t

     W    X    Y   Z
A    0    1  100   3
B  200  200    6   7
C    8    9   10  11